Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: L<Mojo::Server::Prefork> worker processes can be controlled at runtime with the following signals.
ja: [[Mojo::Server::Prefork]] worker processes can be controlled at runtime with the following signals.

source: L<Mojo::Server> implements the following attributes.
ja: [[Mojo::Server]] implements the following attributes.

source: L<Mojo::Server> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::Server]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::Server> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::Server]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::Server> is an abstract base class for HTTP/WebSocket servers and server interfaces, like L<Mojo::Server::CGI>, L<Mojo::Server::Daemon>, L<Mojo::Server::Hypnotoad>, L<Mojo::Server::Morbo>, L<Mojo::Server::Prefork> and L<Mojo::Server::PSGI>.
ja: [[Mojo::Server]] is an abstract base class for HTTP/WebSocket servers and server interfaces, like [[Mojo::Server::CGI]], [[Mojo::Server::Daemon]], [[Mojo::Server::Hypnotoad]], [[Mojo::Server::Morbo]], [[Mojo::Server::Prefork]] and [[Mojo::Server::PSGI]].

source: L<Mojo::Template> contains the whole list of available options.
ja: [[Mojo::Template]] contains the whole list of available options.

source: L<Mojo::Template> implements the following attributes.
ja: [[Mojo::Template]] implements the following attributes.

source: L<Mojo::Template> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Template]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Template> is a minimalistic, fast, and very Perl-ish template engine, designed specifically for all those small tasks that come up during big projects.
ja: [[Mojo::Template]] is a minimalistic, fast, and very Perl-ish template engine, designed specifically for all those small tasks that come up during big projects.

source: L<Mojo::Template> templates get compiled to a Perl subroutine, that means you can access arguments simply via C<@_>.
ja: [[Mojo::Template]] templates get compiled to a Perl subroutine, that means you can access arguments simply via C<@_>.

source: L<Mojo::Transaction::HTTP> inherits all attributes from L<Mojo::Transaction> and implements the following new ones.
ja: [[Mojo::Transaction::HTTP]] inherits all attributes from [[Mojo::Transaction]] and implements the following new ones.

source: L<Mojo::Transaction::HTTP> inherits all events from L<Mojo::Transaction> and can emit the following new ones.
ja: [[Mojo::Transaction::HTTP]] inherits all events from [[Mojo::Transaction]] and can emit the following new ones.

source: L<Mojo::Transaction::HTTP> inherits all methods from L<Mojo::Transaction> and implements the following new ones.
ja: [[Mojo::Transaction::HTTP]] inherits all methods from [[Mojo::Transaction]] and implements the following new ones.

source: L<Mojo::Transaction::HTTP> is a container for HTTP transactions, based on L<RFC 7230|http://tools.ietf.org/html/rfc7230> and L<RFC 7231|http://tools.ietf.org/html/rfc7231>.
ja: [[Mojo::Transaction::HTTP]] is a container for HTTP transactions, based on [[RFC 7230|http://tools.ietf.org/html/rfc7230]] and [[RFC 7231|http://tools.ietf.org/html/rfc7231]].

source: L<Mojo::Transaction::WebSocket> inherits all attributes from L<Mojo::Transaction> and implements the following new ones.
ja: [[Mojo::Transaction::WebSocket]] inherits all attributes from [[Mojo::Transaction]] and implements the following new ones.

source: L<Mojo::Transaction::WebSocket> inherits all events from L<Mojo::Transaction> and can emit the following new ones.
ja: [[Mojo::Transaction::WebSocket]] inherits all events from [[Mojo::Transaction]] and can emit the following new ones.

source: L<Mojo::Transaction::WebSocket> inherits all methods from L<Mojo::Transaction> and implements the following new ones.
ja: [[Mojo::Transaction::WebSocket]] inherits all methods from [[Mojo::Transaction]] and implements the following new ones.

source: L<Mojo::Transaction::WebSocket> is a container for WebSocket transactions, based on L<RFC 6455|http://tools.ietf.org/html/rfc6455> and L<RFC 7692|http://tools.ietf.org/html/rfc7692>.
ja: [[Mojo::Transaction::WebSocket]] is a container for WebSocket transactions, based on [[RFC 6455|http://tools.ietf.org/html/rfc6455]] and [[RFC 7692|http://tools.ietf.org/html/rfc7692]].

source: L<Mojo::Transaction> implements the following attributes.
ja: [[Mojo::Transaction]] implements the following attributes.

source: L<Mojo::Transaction> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::Transaction]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::Transaction> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::Transaction]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::Transaction> is an abstract base class for transactions, like L<Mojo::Transaction::HTTP> and L<Mojo::Transaction::WebSocket>.
ja: [[Mojo::Transaction]] is an abstract base class for transactions, like [[Mojo::Transaction::HTTP]] and [[Mojo::Transaction::WebSocket]].

source: L<Mojo::URL> implements a subset of L<RFC 3986|http://tools.ietf.org/html/rfc3986>, L<RFC 3987|http://tools.ietf.org/html/rfc3987> and the L<URL Living Standard|https://url.spec.whatwg.org> for Uniform Resource Locators with support for IDNA and IRIs.
ja: [[Mojo::URL]] implements a subset of [[RFC 3986|http://tools.ietf.org/html/rfc3986]], [[RFC 3987|http://tools.ietf.org/html/rfc3987]] and the [[URL Living Standard|https://url.spec.whatwg.org]] for Uniform Resource Locators with support for IDNA and IRIs.

source: L<Mojo::URL> implements the following attributes.
ja: [[Mojo::URL]] implements the following attributes.

source: L<Mojo::URL> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::URL]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::URL> objects are very easy to manipulate, just make sure that the URL (C<foo/bar?baz=yada>), which represents the routing destination, is always relative to the base URL (C<http://example.com/myapp/>), which represents the deployment location of your application.
ja: [[Mojo::URL]] objects are very easy to manipulate, just make sure that the URL (C<foo/bar?baz=yada>), which represents the routing destination, is always relative to the base URL (C<http://example.com/myapp/>), which represents the deployment location of your application.

source: L<Mojo::URL> overloads the following operators.
ja: [[Mojo::URL]] overloads the following operators.

source: L<Mojo::Upload> implements the following attributes.
ja: [[Mojo::Upload]] implements the following attributes.

source: L<Mojo::Upload> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Upload]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Upload> is a container for uploaded files.
ja: [[Mojo::Upload]] is a container for uploaded files.

source: L<Mojo::UserAgent::CookieJar> implements the following attributes.
ja: [[Mojo::UserAgent::CookieJar]] implements the following attributes.

source: L<Mojo::UserAgent::CookieJar> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::UserAgent::CookieJar]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::UserAgent::CookieJar> is a minimalistic and relaxed cookie jar used by L<Mojo::UserAgent>, based on L<RFC 6265|http://tools.ietf.org/html/rfc6265>.
ja: [[Mojo::UserAgent::CookieJar]] is a minimalistic and relaxed cookie jar used by [[Mojo::UserAgent]], based on [[RFC 6265|http://tools.ietf.org/html/rfc6265]].

source: L<Mojo::UserAgent::Proxy> implements the following attributes.
ja: [[Mojo::UserAgent::Proxy]] implements the following attributes.

source: L<Mojo::UserAgent::Proxy> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::UserAgent::Proxy]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::UserAgent::Proxy> manages proxy servers for L<Mojo::UserAgent>.
ja: [[Mojo::UserAgent::Proxy]] manages proxy servers for [[Mojo::UserAgent]].

source: L<Mojo::UserAgent::Server> implements the following attributes.
ja: [[Mojo::UserAgent::Server]] implements the following attributes.

source: L<Mojo::UserAgent::Server> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::UserAgent::Server]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::UserAgent::Server> is an embedded web server based on L<Mojo::Server::Daemon> that processes requests for L<Mojo::UserAgent>.
ja: [[Mojo::UserAgent::Server]] is an embedded web server based on [[Mojo::Server::Daemon]] that processes requests for [[Mojo::UserAgent]].

source: L<Mojo::UserAgent::Transactor> implements the following attributes.
ja: [[Mojo::UserAgent::Transactor]] implements the following attributes.

source: L<Mojo::UserAgent::Transactor> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::UserAgent::Transactor]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::UserAgent::Transactor> is the transaction building and manipulation framework used by L<Mojo::UserAgent>.
ja: [[Mojo::UserAgent::Transactor]] is the transaction building and manipulation framework used by [[Mojo::UserAgent]].

source: L<Mojo::UserAgent> can automatically follow redirects, the event L<Mojo::UserAgent/"start"> allows you direct access to each transaction right after they have been initialized and before a connection gets associated with them.
ja: [[Mojo::UserAgent]] can automatically follow redirects, the event [[Mojo::UserAgent/"start"]] allows you direct access to each transaction right after they have been initialized and before a connection gets associated with them.

source: L<Mojo::UserAgent> has been designed from the ground up to be non-blocking, the whole blocking API is just a simple convenience wrapper.
ja: [[Mojo::UserAgent]] has been designed from the ground up to be non-blocking, the whole blocking API is just a simple convenience wrapper.

source: L<Mojo::UserAgent> implements the following attributes.
ja: [[Mojo::UserAgent]] implements the following attributes.

source: L<Mojo::UserAgent> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::UserAgent]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::UserAgent> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::UserAgent]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::UserAgent> is a full featured non-blocking I/O HTTP and WebSocket user agent, with IPv6, TLS, SNI, IDNA, HTTP/SOCKS5 proxy, UNIX domain socket, Comet (long polling), Promises/A+, keep-alive, connection pooling, timeout, cookie, multipart, gzip compression and multiple event loop support.
ja: [[Mojo::UserAgent]] is a full featured non-blocking I/O HTTP and WebSocket user agent, with IPv6, TLS, SNI, IDNA, HTTP/SOCKS5 proxy, UNIX domain socket, Comet (long polling), Promises/A+, keep-alive, connection pooling, timeout, cookie, multipart, gzip compression and multiple event loop support.

source: L<Mojo::Util> implements the following functions, which can be imported individually.
ja: [[Mojo::Util]] implements the following functions, which can be imported individually.

source: L<Mojo::Util> provides portable utility functions for L<Mojo>.
ja: [[Mojo::Util]] provides portable utility functions for [[Mojo]].

source: L<Mojo::WebSocket> implements the WebSocket protocol as described in L<RFC 6455|http://tools.ietf.org/html/rfc6455>.
ja: [[Mojo::WebSocket]] implements the WebSocket protocol as described in [[RFC 6455|http://tools.ietf.org/html/rfc6455]].

source: L<Mojo::WebSocket> implements the following constants, which can be imported individually.
ja: [[Mojo::WebSocket]] implements the following constants, which can be imported individually.

source: L<Mojo::WebSocket> implements the following functions, which can be imported individually.
ja: [[Mojo::WebSocket]] implements the following functions, which can be imported individually.

source: L<Mojo> is a web development toolkit, with all the basic tools and helpers needed to write simple web applications and higher level web frameworks, such as L<Mojolicious>.
ja: [[Mojo]] is a web development toolkit, with all the basic tools and helpers needed to write simple web applications and higher level web frameworks, such as [[Mojolicious]].

source: L<Mojolicious::Command::Author::cpanify> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::cpanify]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::cpanify> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::cpanify]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::cpanify> uploads files to CPAN.
ja: [[Mojolicious::Command::Author::cpanify]] uploads files to CPAN.

source: L<Mojolicious::Command::Author::generate::app> generates application directory structures for fully functional L<Mojolicious> applications.
ja: [[Mojolicious::Command::Author::generate::app]] generates application directory structures for fully functional [[Mojolicious]] applications.

source: L<Mojolicious::Command::Author::generate::app> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::generate::app]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::generate::app> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::generate::app]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::generate::lite_app> generate fully functional L<Mojolicious::Lite> applications.
ja: [[Mojolicious::Command::Author::generate::lite_app]] generate fully functional [[Mojolicious::Lite]] applications.

source: L<Mojolicious::Command::Author::generate::lite_app> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::generate::lite_app]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::generate::lite_app> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::generate::lite_app]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::generate::makefile> generates C<Makefile.PL> files for applications.
ja: [[Mojolicious::Command::Author::generate::makefile]] generates C<Makefile.PL> files for applications.

source: L<Mojolicious::Command::Author::generate::makefile> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::generate::makefile]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::generate::makefile> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::generate::makefile]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::generate::plugin> generates directory structures for fully functional L<Mojolicious> plugins.
ja: [[Mojolicious::Command::Author::generate::plugin]] generates directory structures for fully functional [[Mojolicious]] plugins.

source: L<Mojolicious::Command::Author::generate::plugin> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::generate::plugin]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::generate::plugin> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::generate::plugin]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::generate> inherits all attributes from L<Mojolicious::Commands> and implements the following new ones.
ja: [[Mojolicious::Command::Author::generate]] inherits all attributes from [[Mojolicious::Commands]] and implements the following new ones.

source: L<Mojolicious::Command::Author::generate> inherits all methods from L<Mojolicious::Commands> and implements the following new ones.
ja: [[Mojolicious::Command::Author::generate]] inherits all methods from [[Mojolicious::Commands]] and implements the following new ones.

source: L<Mojolicious::Command::Author::generate> lists available generators.
ja: [[Mojolicious::Command::Author::generate]] lists available generators.

source: L<Mojolicious::Command::Author::inflate> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::inflate]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::inflate> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::Author::inflate]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::Author::inflate> turns templates and static files embedded in the C<DATA> sections of your application into real files.
ja: [[Mojolicious::Command::Author::inflate]] turns templates and static files embedded in the C<DATA> sections of your application into real files.

source: L<Mojolicious::Command::cgi> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::cgi]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::cgi> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::cgi]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::cgi> starts applications with the L<Mojo::Server::CGI> backend.
ja: [[Mojolicious::Command::cgi]] starts applications with the [[Mojo::Server::CGI]] backend.

source: L<Mojolicious::Command::daemon> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::daemon]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::daemon> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::daemon]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::daemon> starts applications with the L<Mojo::Server::Daemon> backend.
ja: [[Mojolicious::Command::daemon]] starts applications with the [[Mojo::Server::Daemon]] backend.

source: L<Mojolicious::Command::eval> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::eval]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::eval> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::eval]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::eval> runs code against applications.
ja: [[Mojolicious::Command::eval]] runs code against applications.

source: L<Mojolicious::Command::get> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::get]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::get> is a command line interface for L<Mojo::UserAgent>.
ja: [[Mojolicious::Command::get]] is a command line interface for [[Mojo::UserAgent]].

source: L<Mojolicious::Command::get> performs requests to remote hosts or local applications.
ja: [[Mojolicious::Command::get]] performs requests to remote hosts or local applications.

source: L<Mojolicious::Command::prefork> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::prefork]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::prefork> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::prefork]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::prefork> starts applications with the L<Mojo::Server::Prefork> backend.
ja: [[Mojolicious::Command::prefork]] starts applications with the [[Mojo::Server::Prefork]] backend.

source: L<Mojolicious::Command::psgi> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::psgi]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::psgi> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::psgi]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::psgi> starts applications with the L<Mojo::Server::PSGI> backend.
ja: [[Mojolicious::Command::psgi]] starts applications with the [[Mojo::Server::PSGI]] backend.

source: L<Mojolicious::Command::routes> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::routes]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::routes> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::routes]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::routes> lists all your application routes.
ja: [[Mojolicious::Command::routes]] lists all your application routes.

source: L<Mojolicious::Command::version> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::version]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.
